Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: For example, if a client sends a PUT request and the underlying connection is closed before any response is received, then the client can establish a new connection and retry the idempotent request.
zh_cn: 例如，如果客户端发送 PUT 请求并且在收到任何响应之前关闭了底层连接，则客户端可以建立新连接并重试幂等请求。

source: For example, if a peer decides to accept an expired certificate (perhaps after confirming this with the user) and wants to continue the connection, it would not generally send a certificate_expired alert.
zh_cn: 例如，如果对等端决定接受过期的证书(可能在与用户确认之后)并且想要继续连接，则通常不会发送 certificate_expired 警报。

source: For example, if an unrecognized status code of 431 is received by the client, it can safely assume that there was something wrong with its request and treat the response as if it had received a 400 status code.
zh_cn: 例如，如果客户端收到无法识别的状态代码 431，则可以安全地假设其请求有问题并将响应视为已收到 400 状态代码。

source: For example, if an unrecognized status code of 471 is received by a client, the client can assume that there was something wrong with its request and treat the response as if it had received a 400 (Bad Request) status code.
zh_cn: 例如，如果客户端收到无法识别的状态代码 471，则客户端可以认为其请求有问题，并将响应视为已收到 400(错误请求)状态代码。

source: For example, if one needs a signaller-like source, a shared enum can be defined and its solo instance `onNext`'d:
zh_cn: 例如，如果需要类似信号器的源，则可以定义共享枚举并将其独立实例 `onNext`：

source: For example, if one wants to perform some periodic background task but each iteration may last longer than the period, it is safe to drop the excess interval notification as there will be more later on:
zh_cn: 例如，如果想要执行一些定期后台任务但每次迭代可能持续的时间超过后台任务周期，则可以安全地删除多余的间隔通知，因为稍后会有更多：

source: For example, if the TCP were to start all connections with sequence number 0, then upon crashing and restarting, a TCP might re-form an earlier connection (possibly after half-open connection resolution) and emit packets with sequence numbers identical to or overlapping with packets still in the network which were emitted on an earlier incarnation of the same connection.
zh_cn: 例如，如果 TCP 要启动序列号为 0 的所有连接，则在崩溃并重新启动时，TCP 可能会重新形成先前的连接(可能在半开连接解析之后)并发射序列号相同或重叠的数据包数据包仍在网络中，这些数据包是在同一连接的早期版本中发射的。

source: For example, if the URI was obtained by clicking on an HTML page which was itself obtained without using HTTP/TLS, a man in the middle could have replaced the URI.
zh_cn: 例如，如果通过单击不使用 HTTP/TLS 获得的 HTML 页面获得 URI，则中间的人可以替换 URI。

source: For example, if the Upgrade header field is received in a GET request and the server decides to switch protocols, it first responds with a 101 (Switching Protocols) message in HTTP/1.1 and then immediately follows that with the new protocol's equivalent of a response to a GET on the target resource.
zh_cn: 例如，如果在 GET 请求中收到 Upgrade 首部字段并且服务器决定切换协议，它首先在 HTTP/1.1 中用 101(交换协议)消息进行响应，然后立即使用新协议等效的响应进行响应到目标资源的 GET。

source: For example, if the server sends dss_fixed_dh certificate type and {{sha1, dsa}, {sha1, rsa}} signature types, the client MAY reply with a certificate containing a static DH key, signed with RSA-SHA1.
zh_cn: 例如，如果服务器发送 dss_fixed_dh 证书类型和 {{sha1, dsa}, {sha1, rsa}} 签名类型，则客户端可以使用包含静态 DH 密钥的证书进行回复，该密钥使用 RSA-SHA1 签名。

source: For example, if the transcript hash was 32 bytes of 01 (this length would make sense for SHA-256), the content covered by the digital signature for a server CertificateVerify would be:
zh_cn: 例如，如果 transcript hash 是 32 字节 01(这个长度对 SHA-256 有意义)，服务器 CertificateVerify 的数字签名所涵盖的内容将是：

source: For example, if the user clicks a lot on the screen, we'd still want to react to its latest input.
zh_cn: 例如，如果用户在屏幕上点击了很多地方，我们仍然希望对其最新的输入做出反应。

source: For example, in earlier versions of TLS, rsa_fixed_dh meant a certificate signed with RSA and containing a static DH key.
zh_cn: 例如，在早期版本的 TLS 中，rsa_fixed_dh 表示使用 RSA 签名并包含静态 DH 密钥的证书。

source: For example, in the inventory example above, `getDemandAsync` could return a `Single<DemandRecord>`.
zh_cn: 例如，在上面的清单示例中，`getDemandAsync` 可以返回 `Single <DemandRecord>`。

source: For example, it is common for Web-based content editing software to use actions within query parameters, such as "page?do=delete".
zh_cn: 例如，基于 Web 的内容编辑软件通常在查询参数中使用动作，例如“page?do=delete”。

source: For example, it would be foolish for a user agent to send stored user credentials [RFC7235] or cookies [RFC6265] in a TRACE request.
zh_cn: 例如，用户代理在 TRACE 请求中发送存储的用户凭证 [RFC7235] 或 cookie [RFC6265] 是愚蠢的。

source: For example, most servers append request information to access log files at the completion of every response, regardless of the method, and that is considered safe even though the log storage might become full and crash the server.
zh_cn: 例如，大多数服务器在每个响应完成时附加请求信息以访问日志文件，而不管方法如何，即使日志存储可能已满并使服务器崩溃，也会认为这是安全的。

source: For example, one URI producer might use a segment such as "name;v=1.1" to indicate a reference to version 1.1 of "name", whereas another might use a segment such as "name,1.1" to indicate the same.
zh_cn: 例如，一个 URI 生成器可能使用诸如“name;v=1.1”之类的段来表示对“name”的版本 1.1 的引用，而另一个 URI 生成器可能使用诸如“name,1.1”之类的段来表示相同。

source: For example, the "file" URI scheme is defined so that no authority, an empty host, and "localhost" all mean the end-user's machine, whereas the "http" scheme considers a missing authority or empty host invalid.
zh_cn: 例如，定义“file”URI 方案，使得没有权限，空主机和“localhost”都表示最终用户的机器，而“http”方案认为缺少权限或空主机无效。

source: For example, the "http" URI scheme (Section 2.7.1) indicates a default connection of TCP over IP, with a default TCP port of 80, but the client might be configured to use a proxy via some other connection, port, or protocol.
zh_cn: 例如，“http”URI 方案(第 2.7.1 节)表示 TCP over IP 的默认连接，默认 TCP 端口为 80，但客户端可能配置为通过某个其他连接，端口或协议。

source: For example, the "http" scheme defines a default port of "80", corresponding to its reserved TCP port number.
zh_cn: 例如，“http”方案定义了默认端口“80”，对应于其保留的 TCP 端口号。

source: For example, the Date header field is defined in Section 7.1.1.2 of [RFC7231] as containing the origination timestamp for the message in which it appears.
zh_cn: 例如，Date 首部字段在 [RFC7231] 的第 7.1.1.2 节中定义为包含它出现的消息的起始时间戳。

source: For example, the URI <mailto:fred@example.com> has a path of "fred@example.com", whereas the URI <foo://info.example.com?fred> has an empty path.
zh_cn: 例如，URI <mailto:fred@example.com> 的路径为“fred@example.com”，而 URI <foo://info.example.com?fred> 的路径为空。

source: For example, the following three URIs are equivalent:
zh_cn: 例如，以下三个 URI 是等效的：

source: For example, the label "slithy toves" would be processed by hashing the following bytes:
zh_cn: 例如，标签“slithy toves”将通过散列以下字节来处理：

source: For example, the operator `interval` emits values periodically, backpressuring it would lead to shifting in the period relative to a wall clock.
zh_cn: 例如，操作符 `interval` 周期性地发射值，背压它会导致相对于挂钟的周期偏移。

source: For example, the payload of a 200 (OK) response to GET (Section 4.3.1) represents the current state of the target resource, as observed at the time of the message origination date (Section 7.1.1.2), whereas the payload of the same status code in a response to POST might represent either the processing result or the new state of the target resource after applying the processing.
zh_cn: 例如，对 GET 的 200(OK)响应的有效载荷(第 4.3.1 节)表示目标资源的当前状态，如在消息发起日期(第 7.1.1.2 节)所观察到的，而有效载荷是 POST 响应中的相同状态代码可能表示应用处理后的目标资源的处理结果或新状态。

source: For example, the request
zh_cn: 例如，请求

source: For example, the request might have been misdirected, deliberately or accidentally, such that the information within a received request-target or Host header field differs from the host or port upon which the connection has been made.
zh_cn: 例如，该请求可能是有意或无意地误导的，使得所接收的请求目标或主机首部字段内的信息不同于已建立连接的主机或端口。

source: For example, the semicolon (";") and equals ("=") reserved characters are often used to delimit parameters and parameter values applicable to that segment.
zh_cn: 例如，分号(“;”)和等于(“=”)保留字符通常用于分隔适用于该段的参数和参数值。

source: For example, there are several overloads of `concatWith` taking the various other reactive base types as arguments (for providing convenience and performance benefits in the underlying implementation):
zh_cn: 例如，有几个 `concatWith` 重载将各种其他响应基类型作为参数(为了在底层实现中提供方便和性能优势)：

source: For example, this can be used to test a proxy for HTTP/1.1 compliance (or lack thereof).
zh_cn: 例如，这可以用于测试 HTTP/1.1 代理的合规性(或缺乏)。

source: For example, this can be used to test a proxy for HTTP/1.1 conformance (or lack thereof).
zh_cn: 例如，这可以用于测试 HTTP/1.1 一致性(或缺少)的代理。

source: For example:
zh_cn: 例如：

source: For externally established PSKs, the associated values are those provisioned along with the key.
zh_cn: 对于外部建立的 PSK，关联值是与密钥一起提供的值。

source: For externally provisioned PSKs, the associated values are those provisioned along with the key.
zh_cn: 对于外部配置的 PSK，关联值是与密钥一起提供的值。

source: For further details, consult the [wiki](https://github.com/ReactiveX/RxJava/wiki).
zh_cn: 有关详细信息，请参阅 [wiki](https://github.com/ReactiveX/RxJava/wiki)。

source: For hash algorithms without parameters (which includes SHA-1), the DigestInfo.AlgorithmIdentifier.parameters field MUST be NULL, but implementations MUST accept both without parameters and with NULL parameters.
zh_cn: 对于没有参数的哈希算法(包括 SHA-1)，DigestInfo.AlgorithmIdentifier.parameters 字段必须为 NULL，但实现必须接受没有参数和 NULL 参数。

source: For instance, a client might offer shares for several elliptic curves or multiple FFDHE groups.
zh_cn: 例如，客户端可能会为多个椭圆曲线或多个 FFDHE 组提供共享。

source: For instance, if the pad appears to be incorrect, the implementation might assume a zero-length pad and then compute the MAC.
zh_cn: 例如，如果填充看起来不正确，则实现可能假设零长度填充然后计算 MAC。

source: For instance, the Early Secret is the Secret for generating the client_early_traffic_secret.
zh_cn: 例如，Early Secret 是生成 client_early_traffic_secret 的机密。

source: For instance, the client might offer DHE_DSS key exchange but omit any DSA pairs from its "signature_algorithms" extension.
zh_cn: 例如，客户端可能提供 DHE_DSS 密钥交换，但省略其“signature_algorithms”扩展中的任何 DSA 对。

source: For instance, when the negotiated connection selects a different ALPN protocol from what was used for the early data, an application might need to construct different messages.
zh_cn: 例如，当协商连接从用于早期数据的协议中选择不同的 ALPN 协议时，应用程序可能需要构造不同的消息。

source: For maximum compatibility, all implementations SHOULD be prepared to handle potentially extraneous certificates and arbitrary orderings from any TLS version, with the exception of the end-entity certificate which MUST be first.
zh_cn: 为了获得最大的兼容性，所有实现都应该准备好处理来自任何 TLS 版本的潜在无关证书和任意排序，但必须首先是最终实体证书。

source: For messages that do include a payload body, the Content-Length field-value provides the framing information necessary for determining where the body (and message) ends.
zh_cn: 对于包含有效载荷主体的消息，Content-Length 字段值提供确定主体(和消息)结束位置所需的成帧信息。

source: For messages that do not include a payload body, the Content-Length indicates the size of the selected representation (Section 3 of [RFC7231]).
zh_cn: 对于不包含有效载荷主体的消息，Content-Length 表示所选表示的大小([RFC7231] 的第 3 节)。

source: For more details on when to send specific HTTP-Version values, see RFC 2145 [36].
zh_cn: 有关何时发送特定 HTTP-Version 的更多详细信息，请参阅 RFC 2145 [36]。

source: For more information about ReactiveX, see the [Introduction to ReactiveX](http://reactivex.io/intro.html) page.
zh_cn: 有关 ReactiveX 的详细信息，请参阅 [ReactiveX 简介](http://reactivex.io/intro.html) 页。

source: For more information, see the table in Section 4.2.
zh_cn: 有关更多信息，请参见第 4.2 节中的表。

source: For non-anonymous key exchanges, a signature over the server's key exchange parameters.
zh_cn: 对于非匿名密钥交换，服务器密钥交换参数上的签名。

source: For protocol elements where optional whitespace is preferred to improve readability, a sender SHOULD generate the optional whitespace as a single SP; otherwise, a sender SHOULD NOT generate optional whitespace except as needed to white out invalid or unwanted protocol elements during in-place message filtering.
zh_cn: 对于优选可选空格以提高可读性的协议元素，发送方应该将可选空白生成为单个 SP;否则，发送方不应生成可选的空格，除非在就地消息过滤期间使无效或不需要的协议元素变成空白。

source: For reasons of backward compatibility with middleboxes (see Appendix D.4), the HelloRetryRequest message uses the same structure as the ServerHello, but with Random set to the special value of the SHA-256 of "HelloRetryRequest":
zh_cn: 出于向后兼容中间件的原因(参见附录 D.4)，HelloRetryRequest 消息使用与 ServerHello 相同的结构，但将 Random 设置为“HelloRetryRequest”的 SHA-256 的特殊值：

source: For response messages, whether or not a message-body is included with a message is dependent on both the request method and the response status code (section 6.1.1).
zh_cn: 对于响应消息，消息主体是否包含在消息中取决于请求方法和响应状态代码(第 6.1.1 节)。

source: For resumed sessions, this field is the value from the resumed session state.
zh_cn: 对于恢复的会话，此字段是来自恢复的会话状态的值。

source: For resumed sessions, this field is the value from the state of the session being resumed.
zh_cn: 对于恢复的会话，此字段是正在恢复的会话状态的值。

source: For secp256r1, secp384r1, and secp521r1, the contents are the serialized value of the following struct:
zh_cn: 对于 secp256r1，secp384r1 和 secp521r1，内容是以下结构的序列化值：

source: For sequence number purposes, the SYN is considered to occur before the first actual data octet of the segment in which it occurs, while the FIN is considered to occur after the last actual data octet in a segment in which it occurs.
zh_cn: 出于序列号的目的，SYN 被认为发生在它发生的报文段的第一个实际数据八位位组之前，而 FIN 被认为发生在它发生的报文段中的最后一个实际数据八位位组之后。

source: For some URI schemes, the visible hierarchy is limited to the scheme itself:
zh_cn: 对于某些 URI 方案，可见层次结构仅限于方案本身：

source: For stream ciphers that do not use a synchronization vector (such as RC4), the stream cipher state from the end of one record is simply used on the subsequent packet.
zh_cn: 对于不使用同步 vector (例如 RC4)的流加密，从一个记录的末尾开始的流加密状态仅用于后续分组。

source: For stream ciphers, this will also contain whatever state information is necessary to allow the stream to continue to encrypt or decrypt data.
zh_cn: 对于流加密，这还将包含允许流继续加密或解密数据所需的任何状态信息。

source: For tags with a number greater than or equal to 31, the identifier shall comprise a leading octet followed by one or more subsequent octets.
zh_cn: 对于数字大于或等于 31 的标签，标识符应包括前导八位字节，后跟一个或多个后续八位字节。

source: For tags with a number ranging from zero to 30 (inclusive), the identifier octets shall compri se a single octet encoded as follows:
zh_cn: 对于编号范围从 0 到 30(含)的标签，标识符八位字节应包含如下编码的单个八位字节：

source: For technical details on how to write operators for 2.x, please visit the [Writing Operators](https://github.com/ReactiveX/RxJava/wiki/Writing-operators-for-2.0) wiki page.
zh_cn: 有关如何为 2.x 编写运算符的技术细节，请访问 [编写运算符](https://github.com/ReactiveX/RxJava/wiki/Writing-operators-for-2.0) wiki 页面。

source: For that reason, many of the algorithm-dependent data structures and rules are included in the body of the text (as opposed to in an appendix), providing easier access to them.
zh_cn: 出于这个原因，许多依赖于算法的数据结构和规则都包含在文本正文中(而不是附录中)，从而更容易访问它们。

source: For the PRF defined in Section 5, the Hash MUST be the Hash used as the basis for the PRF.
zh_cn: 对于 PRF 在第 5 节中定义，哈希必须是用作 PRF 的基础散列。

source: For the computation of the binder_key, the label is "ext binder" for external PSKs (those provisioned outside of TLS) and "res binder" for resumption PSKs
zh_cn: 对于 binder_key 的计算，标签是外部 PSK(在 TLS 之外提供的那些)的“ext binder”和用于恢复 PSK 的“res binder”

source: For the curves secp256r1, secp384r1, and secp521r1, peers MUST validate each other's public value Q by ensuring that the point is a valid point on the elliptic curve.
zh_cn: 对于曲线 secp256r1，secp384r1 和 secp521r1，对等端必须通过确保该点是椭圆曲线上的有效点来验证彼此的公共值 Q。

source: For the definite form, the length octets shall consist of one or more octets, and shall represent the number of octets in the contents octets using either the short form (see 8.1.3.4) or the long form (see 8.1.3.5) as a sender's option.
zh_cn: 对于确定形式，长度八位字节应由一个或多个八位字节组成，并应使用短格式(见 8.1.3.4)或长格式(见 8.1.3.5)表示内容八位字节中的八位字节数，根据发送者的选择。

source: For the indefinite form, the length octets indicate that the contents octets are terminated by end-of contents octets (see 8.1.5), and shall consist of a single octet.
zh_cn: 对于不定形式，长度八位字节表示内容八位字节由结束内容八位字节终止(见 8.1.5)，并且应由一个八位字节组成。

source: For the purposes of HTTP, GMT is exactly equal to UTC (Coordinated Universal Time).
zh_cn: 出于 HTTP 的目的，GMT 完全等于 UTC(协调世界时)。

source: For the purposes of HTTP, a "representation" is information that is intended to reflect a past, current, or desired state of a given resource, in a format that can be readily communicated via the protocol, and that consists of a set of representation metadata and a potentially unbounded stream of representation data.
zh_cn: 出于 HTTP 的目的，“表示”是旨在以可以通过协议容易地传达的格式反映给定资源的过去，当前或期望状态的信息，并且由一组表示元数据和可能无限制的表示数据流组成。

source: For the rest, this gives an opportunity to "extend their internal buffer" by having a larger number with `onBackpressureBuffer` than their default.
zh_cn: 对于其余操作符，这提供了一个“扩展其内部缓冲区”的机会，通过使用 `onBackpressureBuffer` 而不是默认值来扩展它们。

source: For the same reason, `unsubscribeOn` is not called on the regular termination path but only when there is an actual `cancel` (or `dispose`) call on the chain.
zh_cn: 出于同样的原因，`unsubscribeOn` 不会在常规终止路径上调用，而是仅在链上有一个实际的 `cancel`(或 `dispose`)调用时调用。

source: For these curves, implementors do not need to verify membership in the correct subgroup.
zh_cn: 对于这些曲线，实现者不需要验证正确子组中的成员资格。

source: For this reason, instead of subscribing to a Single with the three methods you use to respond to notifications from an Observable (onNext, onError, and onCompleted), you only use two methods to subscribe:
zh_cn: 出于这个原因，不用使用三个方法订阅 Single，来响应来自 Observable 的通知(onNext，onError 和 onCompleted)，你只需要使用两个方法进行订阅：

source: For this reason, the TLS protocol has incorporated an optional session caching scheme to reduce the number of connections that need to be established from scratch.
zh_cn: 出于这个原因，TLS 协议已经包含一个可选的会话缓存方案，以减少需要从头开始建立的连接数。

source: For this reason, you may call ObserveOn multiple times at various points during the chain of Observable operators in order to change on which threads certain of those operators operate.
zh_cn: 因此，您可以在 Observable 操作符链中的不同点多次调用 ObserveOn，以便更改某些操作符运行的线程。

source: For this specification the MSL is taken to be 2 minutes.
zh_cn: 对于此规范，MSL 为 2 分钟。

source: For this version of the specification, the version is 3.3.
zh_cn: 对于此版本的规范，版本为 3.3。

source: For this version of the specification, the version will be 3.3 (see Appendix E for details about backward compatibility).
zh_cn: 对于此版本的规范，版本将为 3.3(有关向后兼容性的详细信息，请参阅附录 E)。

source: For those purposes, it is more appropriate to use a 3xx (Redirection) response (Section 6.4 of [RFC7231]).
zh_cn: 出于这些目的，使用 3xx(重定向)响应([RFC7231] 的第 6.4 节)更合适。

source: Forwarding an HTTP message without rewriting the HTTP-version might result in communication errors when downstream recipients use the message sender's version to determine what features are safe to use for later communication with that sender.
zh_cn: 转发 HTTP 消息而不重写 HTTP 版本可能会导致通信错误，当下游接收者使用邮件发送者的版本来确定哪些功能可以安全地用于以后与该发送者的通信。

source: Four protocols that use the record protocol are described in this document: the handshake protocol, the alert protocol, the change cipher spec protocol, and the application data protocol.
zh_cn: 本文档描述了使用记录协议的四种协议：握手协议，警报协议，更改密码规范协议和应用程序数据协议。

source: Fragment identifier semantics are independent of the URI scheme and thus cannot be redefined by scheme specifications.
zh_cn: 片段标识符语义独立于 URI 方案，因此不能由方案规范重新定义。

source: Fragment identifiers have a special role in information retrieval systems as the primary form of client-side indirect referencing, allowing an author to specifically identify aspects of an existing resource that are only indirectly provided by the resource owner.
zh_cn: 片段标识符在信息检索系统中具有特殊作用，作为客户端间接引用的主要形式，允许作者专门识别仅由资源所有者间接提供的现有资源的方面。

source: Frequently, the entity is stored in coded form, transmitted directly, and only decoded by the recipient.
zh_cn: 通常，实体以编码形式存储，直接传输，并且仅由接收者解码。

source: From a user's perspective, if one was using the the `subscribe` methods other than `Flowable.subscribe(Subscriber<? super T>)`, there is no need to do anything regarding this change and there is no extra penalty for it.
zh_cn: 从用户的角度来看，如果使用 `subscribe` 而不是 `Flowable.subscribe(Subscriber<? super T>)` 方法，则无需对此更改执行任何操作，也不会对其进行额外惩罚。

source: From the Observer’s point of view, it doesn’t matter!
zh_cn: 从观察者的角度来看，这并不重要！

source: From the byte stream, a multi-byte item (a numeric in the example) is formed (using C notation) by:
zh_cn: 从字节流中，通过以下方式形成一个多字节项(示例中的数字)(使用 C 表示法)：

source: From the byte stream, a multi-byte item (a numeric in the following example) is formed (using C notation) by:
zh_cn: 从字节流中，通过以下方式形成一个多字节项(以下示例中的数字)(使用 C 表示法)：

source: From the server's point of view, the connection is being closed while it was idle, but from the client's point of view, a request is in progress.
zh_cn: 从服务器的角度来看，连接在空闲时被关闭，但从客户端的角度来看，请求正在进行中。

source: Full Copyright Statement
zh_cn: 完整的版权声明

source: Full Date
zh_cn: 完整日期

source: Further details on building can be found on the [Getting Started](https://github.com/ReactiveX/RxJava/wiki/Getting-Started) page of the wiki.
zh_cn: 有关构建的更多详细信息，请参见 Wiki 的 [Getting Started](https://github.com/ReactiveX/RxJava/wiki/Getting-Started) 页面。

source: Further information on Internet Standards is available in Section 2 of RFC 5741.
zh_cn: 有关互联网标准的更多信息，请参见 RFC 5741 的第 2 节。

source: Further information on Internet Standards is available in Section 2 of RFC 7841.
zh_cn: 有关互联网标准的更多信息，请参见 RFC 7841 的第 2 节。

source: Further, in 2017, researchers from Google and CWI Amsterdam [SHA-1-Collision] proved SHA-1 collision attacks were practical.
zh_cn: 此外，2017 年，谷歌和 CWI Amsterdam [SHA-1-Collision] 的研究人员证明了 SHA-1 碰撞攻击是切实可行的。

source: Furthermore, it implies end-to-end security.
zh_cn: 此外，它意味着端到端的安全性。

source: Furthermore, some of these names have different implications in other contexts, or seem awkward in the idiom of a particular implementing language.
zh_cn: 此外，这些名称中的一些在其他情境中具有不同的含义，或者在特定实现语言的习语中看起来很怪异。

source: Furthermore, the ordering in the field value is now significant.
zh_cn: 此外，字段值的排序现在很重要。

source: Furthermore, they can lead to security issues along the lines of those described in [RFC1535].
zh_cn: 此外，它们可能导致 [RFC1535] 中描述的安全问题。

source: Furthermore, using multiple connections can cause undesirable side effects in congested networks.
zh_cn: 此外，使用多个连接可能会在拥挤的网络中造成不良副作用。

source: Furthermore, what is commonly understood to be a reasonable length for some protocol elements has changed over the course of the past two decades of HTTP use and is expected to continue changing in the future.
zh_cn: 此外，在过去二十年的 HTTP 使用过程中，通常被理解为某些协议元素的合理长度已经发生了变化，并且预计将来会继续发生变化。

source: Future cipher suites MAY specify other lengths but such length MUST be at least 12 bytes.
zh_cn: 将来的加密套件可以规定其它长度但这种长度必须至少为 12 个字节。

source: Future documents may define how to use them together.
zh_cn: 未来的文件可能会定义如何一起使用它们。

source: Future extensions MUST define their interaction with 0-RTT.
zh_cn: 未来的扩展必须定义它们与 0-RTT 的交互。

source: Future extensions or additions to the protocol may define new values.
zh_cn: 未来对协议的扩展或添加可以定义新值。

source: Future revisions of DSS [DSS-3] are expected to allow the use of other digest algorithms with DSA, as well as guidance as to which digest algorithms should be used with each key size.
zh_cn: DSS [DSS-3] 的未来版本预计允许使用其他摘要算法和 DSA，以及指导哪些摘要算法应与每个密钥大小一起使用。

source: Future specifications and related documentation should use the general term "URI" rather than the more restrictive terms "URL" and "URN" [RFC3305].
zh_cn: 未来的规范和相关文档应使用通用术语“URI”而不是限制性更强的术语“URL”和“URN”[RFC3305]。

source: GET is the primary mechanism of information retrieval and the focus of almost all performance optimizations.
zh_cn: GET 是信息检索的主要机制，也是几乎所有性能优化的重点。

source: GLOSSARY
zh_cn: 词汇表

source: Gateways are often used to encapsulate legacy or untrusted information services, to improve server performance through "accelerator" caching, and to enable partitioning or load balancing of HTTP services across multiple machines.
zh_cn: 网关通常用于封装传统或不受信任的信息服务，通过“加速器”缓存提高服务器性能，并在多台计算机上启用 HTTP 服务的分区或负载平衡。

source: Gateways do not need to generate Via header fields anymore.
zh_cn: 网关不再需要生成 Via 首部字段。

source: General Header Fields
zh_cn: 普通首部字段

source: General Syntax
zh_cn: 一般语法
